# -*- coding: utf-8 -*-
'''
Задание 4.7

Преобразовать MAC-адрес в двоичную строку (без двоеточий).

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

MAC = 'AAAA:BBBB:CCCC'

================================================================

In [36]: MAC
Out[36]: 'AAAA:BBBB:CCCC'

In [37]: MAC.replace(':','')
Out[37]: 'AAAABBBBCCCC'

In [45]: int(MAC.replace(':',''), 16)
Out[45]: 187650270809292

In [47]: bin(int(MAC.replace(':',''), 16))
Out[47]: '0b101010101010101010111011101110111100110011001100'

In [50]: g = '{:b}'.format(int(MAC.replace(':',''), 16))

In [51]: g
Out[51]: '101010101010101010111011101110111100110011001100'
