# -*- coding: utf-8 -*-
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

IP = '192.168.3.1'

=======================================================

In [53]: IP = '192.168.3.1'

In [54]: IP[0]
Out[54]: '1'

In [55]: IP.split('.')
Out[55]: ['192', '168', '3', '1']

In [56]: IP.split('.')[0]
Out[56]: '192'

In [57]: int(IP.split('.')[0])
Out[57]: 192

In [58]: int(IP.split('.')[1])
Out[58]: 168

In [59]: int(IP.split('.')[2])
Out[59]: 3

In [60]: int(IP.split('.')[3])
Out[60]: 1

In [87]: IP2 = """
    ...: {0:10}{1:10}{2:10}{3:10}
    ...: {0:10b}{1:10b}{2:10b}{3:10b}
    ...: """

In [88]: print(IP2.format(int(IP.split('.')[0]), int(IP.split('.')[1]), int(IP.split('.')[2]), int(IP.split('.')[3])))

       192       168         3         1
  11000000  10101000        11         1


In [89]: IP3 = IP2.format(int(IP.split('.')[0]), int(IP.split('.')[1]), int(IP.split('.')[2]), int(IP.split('.')[3]))

In [90]: print(IP3)

       192       168         3         1
  11000000  10101000        11         1


